In [21]:
import pandas as pd
import numpy as np

In [22]:
df = pd.util.testing.makeMissingDataframe()

In [23]:
df.head()

                   A         B         C         D
OwCYtjmBvh  1.064334 -0.352749 -0.971850  0.504223
AvHGpoeCHx  0.396967  0.938971  0.981378  0.519250
zOwAWqDR8F       NaN -0.856058  0.425381  0.417320
ZqcLzhVb97       NaN  0.909476       NaN       NaN
VAKFmiE09s -0.803238 -0.301608 -0.873868  0.075229

In [24]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  BSaV3JddUc -0.178730 -0.509371  1.504687 -0.767304
1  yZEGwM3HPz -0.303291 -1.040358  0.697410 -1.004239
2  NE7szZIKNZ -0.567516 -0.715943  0.024602  0.319168
3  PBH0CahiIr  0.857789 -1.624684 -0.385799  1.741344
4  n0t2LNMyH7       NaN -1.570840  0.363830 -0.178820

In [25]:
df_backup = df.copy(deep=True)
df_backup.head()

        index         A         B         C         D
0  BSaV3JddUc -0.178730 -0.509371  1.504687 -0.767304
1  yZEGwM3HPz -0.303291 -1.040358  0.697410 -1.004239
2  NE7szZIKNZ -0.567516 -0.715943  0.024602  0.319168
3  PBH0CahiIr  0.857789 -1.624684 -0.385799  1.741344
4  n0t2LNMyH7       NaN -1.570840  0.363830 -0.178820

## Menghitung jumlah NaN tiap kolom

In [26]:
df_backup.isna().sum()

index    0
A        3
B        4
C        4
D        1
dtype: int64

## Drop kolom yang mengandung NaN

In [27]:
df.dropna(axis='columns').head()

        index
0  BSaV3JddUc
1  yZEGwM3HPz
2  NE7szZIKNZ
3  PBH0CahiIr
4  n0t2LNMyH7

## Drop baris yang mengandung NaN

In [28]:
df.dropna(axis='rows').head()

        index         A         B         C         D
0  BSaV3JddUc -0.178730 -0.509371  1.504687 -0.767304
1  yZEGwM3HPz -0.303291 -1.040358  0.697410 -1.004239
2  NE7szZIKNZ -0.567516 -0.715943  0.024602  0.319168
3  PBH0CahiIr  0.857789 -1.624684 -0.385799  1.741344
9  nN4Wilfo3i -0.438927  0.281403 -1.181022  1.167687

## Drop kolom yang mengandung NaN berdasarkan nilai treshold

In [39]:
df.isna().mean()

index    0.000000
A        0.100000
B        0.133333
C        0.133333
D        0.033333
dtype: float64

In [40]:
treshold = len(df) * 0.9
treshold

27.0

In [41]:
df.dropna(thresh=treshold, axis='columns').head()

        index         A         D
0  BSaV3JddUc -0.178730 -0.767304
1  yZEGwM3HPz -0.303291 -1.004239
2  NE7szZIKNZ -0.567516  0.319168
3  PBH0CahiIr  0.857789  1.741344
4  n0t2LNMyH7       NaN -0.178820

Kolom yang memiliki jumlah NaN > 90% akan di drop